In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
tiburon = pd.read_csv("data/attacks.csv", encoding = "ISO-8859-1")
tiburon.sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
22106,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22768,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17537,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16371,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23121,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
# Verificamos que sea un dataframe
type(tiburon)

pandas.core.frame.DataFrame

In [5]:
# Ver que tipo de datos hay
tiburon.dtypes

Case Number                object
Date                       object
Year                      float64
Type                       object
Country                    object
Area                       object
Location                   object
Activity                   object
Name                       object
Sex                        object
Age                        object
Injury                     object
Fatal (Y/N)                object
Time                       object
Species                    object
Investigator or Source     object
pdf                        object
href formula               object
href                       object
Case Number.1              object
Case Number.2              object
original order            float64
Unnamed: 22                object
Unnamed: 23                object
dtype: object

In [6]:
tiburon.describe()
# Obtener datos estadÃ­sticos rÃ¡pidos de lo que hay dentro.

              Year  original order
count  6300.000000     6309.000000
mean   1927.272381     3155.999683
std     281.116308     1821.396206
min       0.000000        2.000000
25%    1942.000000     1579.000000
50%    1977.000000     3156.000000
75%    2005.000000     4733.000000
max    2018.000000     6310.000000

In [7]:
# Â¿CuÃ¡ntos nulos existen en cada columna?
tiburon.isnull().sum(axis = 0)

Case Number               17021
Date                      19421
Year                      19423
Type                      19425
Country                   19471
Area                      19876
Location                  19961
Activity                  19965
Name                      19631
Sex                       19986
Age                       22252
Injury                    19449
Fatal (Y/N)               19960
Time                      22775
Species                   22259
Investigator or Source    19438
pdf                       19421
href formula              19422
href                      19421
Case Number.1             19421
Case Number.2             19421
original order            19414
Unnamed: 22               25722
Unnamed: 23               25721
dtype: int64

In [8]:
'''
DespuÃ©s de revisar todos los datos de cada columna del dataframe, hay algunas columnas que podemos eliminar
ya que no nos van a dar informaciÃ³n relevante en el estudio de los ataques de tiburones. Estas son; 
"Name", "Investigator or Source", "pdf", "href formula", "href", "Case Number.1", "Case Number.2", 
"original order", "Unnamed: 22", "Unnamed: 23".
'''

'\nDespuÃ©s de revisar todos los datos de cada columna del dataframe, hay algunas columnas que podemos eliminar\nya que no nos van a dar informaciÃ³n relevante en el estudio de los ataques de tiburones. Estas son; \n"Name", "Investigator or Source", "pdf", "href formula", "href", "Case Number.1", "Case Number.2", \n"original order", "Unnamed: 22", "Unnamed: 23".\n'

In [9]:
# Se eliminan las columnas; 
tiburon2 = tiburon.drop(["Name", "Investigator or Source", "pdf", "href formula", "href", "Case Number.1", "Case Number.2", 
"original order", "Unnamed: 22", "Unnamed: 23"], axis=1)
tiburon2.sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
3440,1969.02.17.R,Reported 17-Feb-1969,1969.0,Provoked,AUSTRALIA,Tasmania,Taroona,Fishing,M,49,Lacerations to hand from hooked shark PROVOKED...,N,Daytime,7-gill shark
2336,1995.10.01,01-Oct-1995,1995.0,Unprovoked,USA,Florida,"Ormond Beach, Volusia County",Surfing,M,39,Right arm injured,N,11h30,1.2 m to 1.5 m [4' to 5'] shark
20817,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7789,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23982,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
# Revisamos aquellas filas que tengan todos los valores NaN (no proporcionan informaciÃ³n) y se eliminan:
(tiburon2[tiburon2.duplicated()]).sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
22207,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22528,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16387,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20876,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13803,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
# El recuento de todas las filas duplicadas es:
tiburon2.duplicated().sum()

19418

In [12]:
# Eliminamos todas las filas que tengan NaN en todas las columnas
tiburon3 = tiburon2.dropna(how='all')
tiburon3.sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
1572,2005.07.01,1-Jul-2005,2005.0,Unprovoked,USA,Florida,"Boca Grande, Lee County",Standing,M,19,Ankle bitten,N,11h30,NaN
5247,1920.11.29,29-Nov-1920,1920.0,Unprovoked,AUSTRALIA,Western Australia,Bunbury,Wading,M,NaN,Lacerations to leg & hand,N,NaN,4' to 5' shark
2581,1991.09.19,19-Sep-1991,1991.0,Invalid,BAHAMAS,NaN,Bimini,Spearfishing,M,32,"Initally reported as a shark attack, forensic ...",NaN,17h00,Invalid
509,2014.08.27.c,27-Aug-2014,2014.0,Unprovoked,SPAIN,Alicante,Benidorm,Swimming,F,30s,Minor lacerations to posterior lower leg,N,NaN,small shark
6950,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
'''
DespuÃ©s de eliminar todas las filas que tienen todo NaN, reviso aquellas filas que puedan estar duplicadas.
La informaciÃ³n obtenida es que todo son NaN excepto el Case Number que es = 0, por tanto, tampoco es informaciÃ³n Ãºtil para el 
estudio y se pueden eliminar.
'''
(tiburon3[tiburon3.duplicated()]).sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
8311,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8215,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7334,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7780,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8061,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
tiburon4 = tiburon3.drop_duplicates()
tiburon4.tail(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
6299,ND.0003,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,M,NaN,FATAL,Y,NaN,NaN
6300,ND.0002,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ÂºN, 79ÂºW",NaN,M,NaN,FATAL,Y,NaN,NaN
6301,ND.0001,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN
6302,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
# Se eliminan las filas en las que todo es NaN y el 'Case Number' es igual a 0 y a xx (son las dos Ãºltimas filas)
tiburon5 = tiburon4.drop([6302, 25722], axis = 0)
tiburon5.tail(3)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
6299,ND.0003,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,M,NaN,FATAL,Y,NaN,NaN
6300,ND.0002,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ÂºN, 79ÂºW",NaN,M,NaN,FATAL,Y,NaN,NaN
6301,ND.0001,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN

In [16]:
# Ya no hay filas con elementos duplicados.
(tiburon5[tiburon5.duplicated()])

Empty DataFrame
Columns: [Case Number, Date, Year, Type, Country, Area, Location, Activity, Sex , Age, Injury, Fatal (Y/N), Time, Species ]
Index: []

In [17]:
# Paso a minÃºscula todos los nombres de las columnas y cambio el nombre de dos de ellas para eliminar carÃ¡cteres especiales.
tiburon5.columns = map(str.lower, tiburon5.columns)
tiburon5.head(2)

,case number,date,year,type,country,area,location,activity,sex,age,injury,fatal (y/n),time,species
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,F,57,"No injury to occupant, outrigger canoe and pad...",N,18h00,White shark
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,F,11,Minor injury to left thigh,N,14h00 -15h00,NaN

In [18]:
tiburon6 = tiburon5.rename(columns = {'case number':'case',
                                     'fatal (y/n)':'fatal',
                                     'sex ':'sex',
                                     'species ': 'species'})
tiburon6.columns.tolist()

['case',
 'date',
 'year',
 'type',
 'country',
 'area',
 'location',
 'activity',
 'sex',
 'age',
 'injury',
 'fatal',
 'time',
 'species']

In [19]:
# Antes de plantear las hipÃ³tesis, he decidido mirar dentro de cada columna sus valores Ãºnicos para ver que hay en cada una.

In [20]:
# tiburon6['fatal'].unique().tolist()


## HIPÃ“TESIS

* El sexo masculino ha sufrido mÃ¡s ataques de tiburÃ³n.

* El tiburÃ³n blanco es el mÃ¡s peligroso.

* Hay mÃ¡s ataques de tiburÃ³n provocados.

In [21]:
'''
DespuÃ©s de revisar todos los datos de cada columna y plantear las hipÃ³tesis, hay ciertas columnas que no son relevantes
para llegar a las conclusiones, por lo que se van a eliminar. Son las siguientes:
'case', 'date', 'area', 'location', 'injury', 'time'
Las variables 'year', 'activity' y 'country', en principio no son necesarias para el estudio de las hipÃ³tesis pero se mantendrÃ¡n por que
podrÃ­an proporcionar informaciÃ³n relevante en cuanto a localizaciÃ³n o tiempo de los ataques.
'''

"\nDespuÃ©s de revisar todos los datos de cada columna y plantear las hipÃ³tesis, hay ciertas columnas que no son relevantes\npara llegar a las conclusiones, por lo que se van a eliminar. Son las siguientes:\n'case', 'date', 'area', 'location', 'injury', 'time'\nLas variables 'year', 'activity' y 'country', en principio no son necesarias para el estudio de las hipÃ³tesis pero se mantendrÃ¡n por que\npodrÃ­an proporcionar informaciÃ³n relevante en cuanto a localizaciÃ³n o tiempo de los ataques.\n"

In [22]:
tiburon7 = tiburon6.drop(['case', 'date', 'area', 'location', 'age', 'injury', 'time'], axis=1)
tiburon7

,year,type,country,activity,sex,fatal,species
0,2018.0,Boating,USA,Paddling,F,N,White shark
1,2018.0,Unprovoked,USA,Standing,F,N,NaN
2,2018.0,Invalid,USA,Surfing,M,N,NaN
3,2018.0,Unprovoked,AUSTRALIA,Surfing,M,N,2 m shark
4,2018.0,Provoked,MEXICO,Free diving,M,N,"Tiger shark, 3m"
...,...,...,...,...,...,...,...
6297,0.0,Unprovoked,AUSTRALIA,Diving,M,Y,NaN
6298,0.0,Unprovoked,AUSTRALIA,Pearl diving,M,Y,NaN
6299,0.0,Unprovoked,USA,Swimming,M,Y,NaN
6300,0.0,Unprovoked,PANAMA,NaN,M,Y,NaN
6301,0.0,Unprovoked,CEYLON (SRI LANKA),Swimming,M,Y,NaN

In [23]:
# AÃºn hay NaNs en algunas columnas. Voy a ver cuantos y a reemplazarlos por 'Unknown'
tiburon7.isnull().sum()

year           2
type           4
country       50
activity     544
sex          565
fatal        539
species     2838
dtype: int64

In [24]:
# Sustituyo todos los NaN por "Unknown"
tiburon7.fillna('Unknown', inplace= True)
tiburon7.sample(5)

,year,type,country,activity,sex,fatal,species
1441,2006.0,Invalid,BRAZIL,Unknown,M,Unknown,Shark involvement prior to death was not confi...
3630,1965.0,Unprovoked,USA,Spearfishing,M,N,"White shark, 10' to 12'"
929,2011.0,Unprovoked,AUSTRALIA,Washing sand off a speared fish,M,N,"reef shark, 1.5m"
5264,1919.0,Unprovoked,AUSTRALIA,Swimming,M,Y,Unknown
2729,1988.0,Unprovoked,USA,Scuba diving,M,N,Sandtiger shark

In [25]:
tiburon7.isna().sum()

year        0
type        0
country     0
activity    0
sex         0
fatal       0
species     0
dtype: int64

## Variable 'year'

In [26]:
#Ojo!!  Donde haya 1s son Unknown!! 
tiburon7['year'] = tiburon7['year'].replace(['Unknown'], '1')

In [27]:
tiburon7['year'] = tiburon7['year'].astype(int)

In [28]:
# tiburon7['year'].unique().tolist()

In [29]:
tiburon7['year'] = tiburon7['year'].replace([1], 'Unknown')

## Variable 'type'

In [30]:
tiburon7['type'] = tiburon7['type'].replace(['Boating', 'Boatomg'], 'Boat')

In [31]:
tiburon7['type'].unique().tolist()

['Boat',
 'Unprovoked',
 'Invalid',
 'Provoked',
 'Questionable',
 'Sea Disaster',
 'Unknown']

# Variable 'Country'

In [32]:
# tiburon7['country'].unique().tolist()

In [33]:
tiburon7['country'] = tiburon7['country'].str.lower().str.strip()

In [34]:
# tiburon7['country'].unique().tolist()

In [60]:
tiburon7['country'].value_counts().head(5)

usa                 2229
australia           1338
south africa         579
papua new guinea     134
new zealand          128
Name: country, dtype: int64

## Variable 'Sex'

In [37]:
tiburon7['sex'].unique().tolist()

['F', 'M', 'Unknown', 'M ', 'lli', 'N', '.']

In [38]:
# Se eliminan espacios en blanco
tiburon7['sex'] = tiburon7['sex'].str.strip()

In [39]:
# Se crea una funciÃ³n para que todos aquellos carÃ¡cteres que no sean ni 'M' ni 'F' se sustituyan por 'unknown'
def funcion_sex (a):
    if a not in ('F', 'M'):
        return 'Unknown'
    else:
        return a

In [40]:
# Se aplica la funciÃ³n a toda la columna
tiburon7.sex = tiburon7.sex.apply(funcion_sex)

In [41]:
# Comprobamos que todo estÃ© ok
tiburon7['sex'].unique().tolist()

['F', 'M', 'Unknown']

## Variable 'fatal'

In [42]:
tiburon7.fatal = tiburon7.fatal.str.replace(' ', '').str.upper()

In [43]:
tiburon7['fatal'].unique().tolist()

['N', 'Y', 'UNKNOWN', 'M', '2017']

In [44]:
tiburon7['fatal'] = tiburon7['fatal'].replace(['2017','M'], 'UNKNOWN')

In [45]:
tiburon7['fatal'] = tiburon7['fatal'].replace(['UNKNOWN'], 'Unknown')

In [46]:
tiburon7['fatal'].unique().tolist()

['N', 'Y', 'Unknown']

## Variable 'species'

In [47]:
# tiburon7['species'].unique().tolist()

In [49]:
#Elimino todos los nÃºmeros que hay en la lista y se pasa todo a minÃºsculas
tiburon7.species = tiburon7.species.str.replace('[\d]+.', '').str.lower()

<ipython-input-49-91f2f07c4000>:2: FutureWarning: The default value of regex will change from True to False in a future version.
  tiburon7.species = tiburon7.species.str.replace('[\d]+.', '').str.lower()

In [50]:
# tiburon7['species'].unique().tolist()

In [51]:
tiburon7['species'].value_counts().head(10)

unknown                                               2839
 shark                                                 234
m [] shark                                             211
white shark                                            164
shark involvement prior to death was not confirmed     105
invalid                                                102
 to  shark                                             100
m shark                                                100
shark involvement not confirmed                         89
tiger shark                                             73
Name: species, dtype: int64

In [52]:
import re
L = ['white shark', 'tiger shark', 'bull shark', 'mako shark', 
     'lemon shark', 'whitetip shark', 'blue shark', 'galapagos shark', 'caribbean shark', 'dusty shark', 
     'black shark', 'silky shark', 'reef shark', 'hammerhead shark', 'nurse shark', 'blacktip shark', 
     'wobbegong shark', 'raggedtooth shark']

pat = '|'.join(r"\b{}\b".format(x) for x in L)

tiburon7['especies'] = tiburon7['species'].str.extract('('+ pat + ')', expand=False, flags=re.I)

In [53]:
tiburon7['especies'].unique().tolist()

['white shark',
 nan,
 'tiger shark',
 'lemon shark',
 'bull shark',
 'reef shark',
 'nurse shark',
 'wobbegong shark',
 'blacktip shark',
 'galapagos shark',
 'whitetip shark',
 'blue shark',
 'mako shark',
 'silky shark',
 'hammerhead shark',
 'raggedtooth shark']

In [54]:
tiburon7['especies'].value_counts().sum()

1573

In [55]:
tiburon7.especies.isna().sum()

4729

In [ ]:
#tiburon7.fillna('Unknown', inplace= True)

In [58]:
## Exportar csv limpio a mi carpeta:
tiburon7.to_csv('sharks_clean.csv', index = False)